//
//  BNF.swift
//  Compiler
//
//  Created by nastasya on 30.04.2024.
//

import Foundation

var bnf = """
Язык = “Программа” Звено…Звено “Конец”
Звено = “Ввод” Слово…Слово
Слово = Метка “:” Переменная “=“ Правая часть
Правая часть = </“-“/> БлокМ [“+” / “-”]…БлокМ
БлокМ = БлокЛ [“*” / “/”]…БлокЛ
БлокЛ = БлокН [“&&” / “||”]…БлокН
БлокН = </“!”/> Частица
Частица = Переменная ! Целое ! “(” Правая часть “)” ! “[” Правая часть“]” <= 2
Метка = Целое
Целое = Цифра…Цифра
Переменная = Буква Цифра Цифра Цифра
Буква = “А” ! “Б” … ! “Я”
Цифра = “0” ! “1” ! … ! “7”
"""

let input = """
Программа 
Ввод
1: А123 = 345 + 456
2: Д435 = 54 / 2 * р123
Ввод
5: з343 = !(2 || 1 && 3 ) + [[5-1]-1]
Конец
"""

